package practice.ilist;

public interface Ilist {
    // узнать размер списка

    // есть ли что-то в списке или он пустой

    // добавить элемент списка

    // добавить (вставить) элемент по индексу

    // удалить элемент, если он есть (а все ли элементы мы удалим?)

    // удалить элемент из списка по индексу

    // обновить элемент в списке по его индексу

    // есть ли элемент в списке

    // найти элемент по его индексу

    // зная элемент, найти его индекс

    // удалить все из списка

    // ищем индекс элемента с конца списка
}
